{
	"description": "Sviluppatore Front-end e WordPress specializzato nella creazione di siti web responsive da design complessi, nell'ottimizzazione delle prestazioni e nella garanzia della massima sicurezza. Competente in CSS, HTML, personalizzazione di temi WordPress e integrazione di plugin.",
	"intro_text": "Lavoro nello sviluppo front-end da più di {{years}} anni e da sempre la mia passione è lo sviluppo di siti web.<br/>Sono esperto nello sviluppo di interfacce dinamiche utilizzando WordPress, con competenze nella trasformazione dei design in codice, nell'impostazione dell'ambiente, nella personalizzazione dei temi e nell' integrazione dei plugin, assicurando prestazioni e sicurezza ottimali del sito web.",
	"exp_intro_text": "Con una solida esperienza di oltre {{years}} anni nel campo dello sviluppo web, ho attraversato diverse fasi cruciali dell'evoluzione di questa industria. Fin dai primi passi della mia carriera, ho mostrato una fervida passione per la programmazione, concentrandomi soprattutto sullo sviluppo front-end e sulle piattaforme di gestione dei contenuti come WordPress. Nel corso degli anni, ho assistito al sorgere e al declino di varie tecnologie e metodologie, adattandomi costantemente per rimanere al passo con le tendenze emergenti.",
	"about_text": "Ho {{age}} anni e sono un sviluppatore Front-end e <strong>WordPress</strong>.<br/><br/>Sono esperto nel convertire i design in codice HTML responsivo di alta qualità e particolarmente appassionato nel trasformare design intricati in codice impeccabile. La mia forte passione per il <strong>CSS</strong> e il suo ruolo nel dare vita ai design alimenta il mio entusiasmo nel creare siti web visivamente sorprendenti e responsivi.<br/>Con un occhio attento ai dettagli, assicuro risultati perfetti al pixel e applico metodi di ottimizzazione per migliorare le prestazioni del sito.<br/>Competente nei principali strumenti di editing fotografico, affino abilmente le immagini per elevare la qualità, allineandole perfettamente al design del sito e all'estetica del brand.<br/><br/>La mia esperienza si estende allo sviluppo e alla manutenzione di siti <strong>WordPress</strong>, alla creazione di temi e plugin personalizzati e alla migrazione dei siti web sulla piattaforma <strong>WordPress</strong>.<br/>Posso vantare una solida esperienza nell'integrare plugin essenziali come WPML e WooCommerce per migliorare la funzionalità del sito e nell'implementazione delle migliori pratiche di <strong>SEO</strong> e CRO per massimizzare la visibilità e l'engagement degli utenti.<br/><br/>Mi trovo bene in ambienti di lavoro dinamici e dimostro competenza nella gestione di più progetti contemporaneamente, anche sotto vincoli di tempo rigorosi.",
	"tooltip_linkedin": "Visita il mio profilo LinkedIn",
	"tooltip_github": "Visita il mio profilo GitHub",
	"tooltip_download_cv": "Scarica il mio CV",
	"tooltip_contact": "Contattami",
	"skills": [
		"Lunga esperienza con HTML e CSS, inclusa la compatibilità cross-browser, la responsività e le prestazioni",
		"Trasformazione di layout PSD complessi in template HTML5/CSS3 perfetti al pixel",
		"Sviluppo di temi e plugin personalizzati",
		"Sviluppo e supporto alla manutenzione per siti WordPress",
		"Migrazione di siti web da altre piattaforme a WordPress",
		"Integrazione e configurazione di plugin come WPML, WooCommerce, Yoast SEO, ecc.",
		"Esperienza con WordPress e Gutenberg e la creazione di blocchi personalizzati",
		"Ottimizzazione della velocità delle pagine dei siti WordPress",
		"Implementazione delle migliori pratiche SEO/CRO nei siti WordPress",
		"Conoscenza degli strumenti di progettazione come Sketch, Figma e Adobe XD",
		"Solida comprensione delle buone pratiche di UX e UI per i siti web",
		"Utilizzo di sistemi di controllo versione come Git / GitHub",
		"Scrittura di JavaScript moderno e performante utilizzando le ultime tecnologie",
		"Conoscenza nell'interpretare design e/o specifiche e adattarle al codice",
		"Esperienza con gli strumenti di sviluppo front-end (come Webpack)",
		"Esperienza nel lavoro remoto",
		"Lavoro sotto scadenze strette e gestione di più progetti contemporaneamente",
		"Produzione di lavori di alta qualità con un forte focus sui dettagli",
		"Esperienza nell'utilizzo di sistemi a componenti",
		"Abilità nello stimare il lavoro per un progetto e trasformare le specifiche in compiti chiaramente definiti ed eseguibili"
	],
	"label_hybrid": "Ibrido",
	"label_onsite": "In sede",
	"exp_1": [
		"Ho sfruttato la mia competenza autodidatta in <strong>CSS</strong>, <strong>HTML</strong> e <strong>JavaScript (jQuery)</strong> per sviluppare interfacce web che sono passate da essere utilizzabili solo su desktop a design responsivi. Questo ha coinvolto una serie di progetti, principalmente siti web, in cui ho coperto lo sviluppo front-end e back-end, utilizzando <strong>ASP</strong> e database <strong>Access/SQLite</strong> per un'integrazione dati senza soluzione di continuità.",
		"In questo ruolo, non solo ho guidato la creazione di interfacce utente dinamiche e visivamente accattivanti, ma ho anche contribuito significativamente a numerosi progetti di web-app.",
		"La mia competenza nei programmi di editing fotografico e grafico mi ha permesso di apportare aggiustamenti e modifiche precise agli asset visivi. Questo insieme di competenze è stato fondamentale per integrare perfettamente il design dei siti e il loro branding, contribuendo a un'esperienza utente coerente e curata."
	],
	"exp_2": [
		"Sviluppo di una vasta gamma di progetti, tra cui siti web statici, landing page, modelli di newsletter e temi <strong>WordPress</strong> personalizzati, utilizzando <strong>PHP</strong>, <strong>CPT</strong> e <strong>ACF</strong>.",
		"Ho garantito la responsività dei design attraverso un'implementazione meticolosa di <strong>(S)CSS</strong>, <strong>HTML</strong> e <strong>JavaScript</strong>, mentre sovrintendevo alla manutenzione e all'ottimizzazione del sito gestito senza soluzione di continuità tramite <strong>Git</strong>.",
		"Ho gestito il trasferimento di contenuti da sviluppo a produzione, gestendo le configurazioni necessarie, inclusi setup lato server.",
		"Conversione di design in codice, dando priorità all'attenzione ai dettagli e ottenendo risultati perfetti al pixel. Implementato tecniche di ottimizzazione per prestazioni migliorate, lavorando ampiamente con layout di design da <strong>InDesign</strong> e <strong>Adobe XD</strong>. Ho utilizzato regolarmente <strong>Photoshop</strong> per ottimizzare e perfezionare gli aspetti del design, garantendo un prodotto finale che rispetti gli standard più elevati di precisione."
	],
	"exp_3": [
		"Ho guidato l'evoluzione dello sviluppo front-end per i temi <strong>WordPress</strong>, ponendo un forte accento su temi pre-costruiti e sviluppo visuale, utilizzando <strong>ACF</strong> e costruttori di pagine come Elementor.",
		"Conversione di design in codice HTML responsivo, garantendo risultati perfetti al pixel e implementando tecniche di ottimizzazione per prestazioni del sito web elevate.",
		"Ho sfruttato il codice <strong>PHP</strong> per la personalizzazione diretta dei modelli, semplificando il processo di inserimento dati per un maggiore rendimento e personalizzazione.",
		"Dimostrata esperienza nei programmi di editing fotografico e grafico, garantendo aggiustamenti e modifiche precise per gli asset visivi, integrandosi senza soluzione di continuità con il design del sito web e il branding.",
		"Ho supervisionato l'intera procedura di trasferimento di contenuti dall'ambiente di sviluppo a quello di produzione, occupandomi di tutte le installazioni necessarie, inclusi le configurazioni lato server."
	],
	"contact_text": "Lasciami un messaggio utilizzando il modulo qui sotto.<br /><br/>Sono alla ricerca di occasioni che mi permettano di dare un contributo sostanziale a una varietà di progetti e sono desideroso di applicare le mie competenze in posizioni freelance o contrattuali a tempo parziale, idealmente in un contesto remoto.<br/><br/>Non vedo l'ora di connetterci e discutere insieme nuove opportunità!",
	"contact_thank_you": "Grazie per il tuo messaggio!",
	"contact_label_first_name": "Nome",
	"contact_label_last_name": "Cognome",
	"contact_label_company": "Azienda",
	"contact_label_message": "Il tuo messaggio",
	"contact_label_send": "Invia",
	"portfolio_intro": "I siti che vedete qui rappresentano i miei lavori più recenti. Alcuni sono stati realizzati partendo da un template pre-acquistato, altri sono stati creati da zero. Oltre alla realizzazione del layout, mi sono occupato della configurazione di plugin, custom post type, ACF quando necessario, e della gestione lato server. Questi progetti evidenziano le mie competenze in HTML, CSS, JavaScript, PHP, e la mia profonda conoscenza dell'ecosistema WordPress."
}
